In [1]:
import pandas as pd

In [2]:
average_salaries = pd.Series({"Russia": 1000, "UK": 2000, "Spain": 800})
population = pd.Series({"Russia": 145, "Spain":80})
country_data = pd.DataFrame({
    "salary": average_salaries,
    "population": population
})
country_data

        salary  population
Russia    1000       145.0
Spain      800        80.0
UK        2000         NaN

In [3]:
country_data.index

Index(['Russia', 'Spain', 'UK'], dtype='object')

In [4]:
country_data.values

array([[1000.,  145.],
       [ 800.,   80.],
       [2000.,   nan]])

In [5]:
country_data.axes

[Index(['Russia', 'Spain', 'UK'], dtype='object'),
 Index(['salary', 'population'], dtype='object')]

In [6]:
country_data.keys()

Index(['salary', 'population'], dtype='object')

In [8]:
type(country_data["salary"])

pandas.core.series.Series

In [10]:
country_data

        salary  population
Russia    1000       145.0
Spain      800        80.0
UK        2000         NaN

In [13]:
country_data.loc["Russia"]

salary        1000.0
population     145.0
Name: Russia, dtype: float64

In [12]:
country_data.iloc[0]

salary        1000.0
population     145.0
Name: Russia, dtype: float64

In [18]:
country_data.loc["Russia":"Spain", "salary":"population"]

        salary  population
Russia    1000       145.0
Spain      800        80.0

In [23]:
country_data.iloc[0:2, 0:2]

        salary  population
Russia    1000       145.0
Spain      800        80.0

In [25]:
people = pd.DataFrame([{"name": "John", "age": 12}, {"name": "Anna", "age": 14}])
people

   name  age
0  John   12
1  Anna   14

In [26]:
people.shape

(2, 2)